Revit 2024 API
AnalyticalCurveType Enumeration
 Identifies what type of Analytical Model curves should be extracted.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum AnalyticalCurveType
Visual Basic
<ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")> _
Public Enumeration AnalyticalCurveType
Visual C++
[ObsoleteAttribute(L"This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum class AnalyticalCurveType
Members
Member name | Description
RawCurves |  Base Analytical Model curves generated.
RigidLinkHead |  Rigid Link at end 0 (head) of the Beam.
RigidLinkTail |  Rigid Link at end 1 (tail) of the Beam.
ActiveCurves |  Curves displayed on screen (not including Rigid Links).
ApproximatedCurves |  Curves approximated using linear segments.
BaseCurve |  Default Analytical Model curve of linear elements (beams, braces, columns).
AllRigidLinks |  All Rigid Link curves. Rigid Link at end 0 (head) will be in the first entry. Rigid Link at end 1 (tail) will be in the last entry.
See Also
Autodesk.Revit.DB.Structure Namespace